pd.Series(data, index=

In [1]:
import pandas as pd

In [2]:
l=[1,2,3,4,5]
pd.Series(l)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
li={11:15,72:25,44:43,86:25,28:23}
li

{11: 15, 28: 23, 44: 43, 72: 25, 86: 25}

In [4]:

li2=pd.Series(data=li)
li2

11    15
28    23
44    43
72    25
86    25
dtype: int64

In [5]:
print(li2)
li2[11],li2[28]

11    15
28    23
44    43
72    25
86    25
dtype: int64

(15, 23)

In [6]:

li2[11]=12
print(li2)

11    12
28    23
44    43
72    25
86    25
dtype: int64

In [7]:

print(li2)
li2.pop(44)

11    12
28    23
44    43
72    25
86    25
dtype: int64

43

In [8]:
li2[44]=49
li2

11    12
28    23
72    25
86    25
44    49
dtype: int64

In [9]:
s=pd.Series(l,index=[38,23,95,26,77])
s

38    1
23    2
95    3
26    4
77    5
dtype: int64

In [10]:
li={11:15,72:25,44:43,86:25,28:23}

In [11]:
pd.read_excel
pd.read_html

In [12]:
o=[range(6)]
j=[range(3,8)]
l=[range(4,9)]

In [13]:
try:
    t = pd.Series([o,j,l])
    
except:
    print('not a series')
print(t)

0    [[0, 1, 2, 3, 4, 5]]
1       [[3, 4, 5, 6, 7]]
2       [[4, 5, 6, 7, 8]]
dtype: object

In [15]:
o=range(6)
j=range(3,8)
l=range(4,9)
o

[0, 1, 2, 3, 4, 5]

In [20]:
a=pd.DataFrame(data=[o,j,l],columns=['a','b','c','d','f','g'],index=['ab','bc','cd'])
a

    a  b  c  d  f    g
ab  0  1  2  3  4  5.0
bc  3  4  5  6  7  NaN
cd  4  5  6  7  8  NaN

In [37]:
o=range(6)
j=range(3,8)
l=range(4,9)
o
b=pd.DataFrame(data=[o,j,l],columns=['a','c','k','f','d','b'],index=['ab','bc','cd'])
b.columns.name='ikea'
b.index.name='furniture'
b

ikea       a  c  k  f  d    b
furniture
ab         0  1  2  3  4  5.0
bc         3  4  5  6  7  NaN
cd         4  5  6  7  8  NaN

In [36]:
li0={11:15,72:25,44:43,86:25,28:23}
li1={11:38,72:52,44:33,87:25,29:23}
c=pd.Series(data=[li0,li1])
c

0    {72: 25, 28: 23, 11: 15, 44: 43, 86: 25}
1    {72: 52, 11: 38, 44: 33, 29: 23, 87: 25}
dtype: object

In [54]:
li={"a":range(5),"c":range(3,8),"b":range(4,9)}
s=pd.DataFrame(li)
print(s)
a=pd.DataFrame(data=[o,j,l],columns=['a','b','c','d','f','g'],index=['ab','bc','cd'])
print(a)

   a  b  c
0  0  4  3
1  1  5  4
2  2  6  5
3  3  7  6
4  4  8  7
    a  b  c  d  f    g
ab  0  1  2  3  4  5.0
bc  3  4  5  6  7  NaN
cd  4  5  6  7  8  NaN

In [65]:
pd.read_excel("C:\Users\umama\OneDrive\Desktop\New Microsoft Excel Worksheet.xlsx")

   Unnamed: 0  Unnamed: 1   open   high    low    LTP
0  1930-05-01         140   9.50  15.35   8.55  12.15
1  1930-06-01         150   2.90   6.55   2.70   3.80
2  1930-07-01         160   1.10   2.10   0.65   0.80
3  2027-06-01         140  17.00  21.00  16.80  18.75
4  2027-07-01         150  12.00  15.25  11.75  13.10
5  2027-08-01         160   8.15  10.70   7.90   9.05
6  1930-05-01         140   1.30   1.30   0.30   0.30
7  1930-06-01         150   4.55   4.55   1.30   1.45
8  1930-07-01         160  11.90  12.00   6.75   8.60
9  2027-06-01         140   8.70   9.40   6.80   7.55
10 2027-07-01         150  13.50  14.05  10.90  11.90
11 2027-08-01         160  19.70  19.70  16.25  17.45

In [86]:
d=pd.read_csv("C:\Users\umama\OneDrive\Desktop\New Microsoft Excel Worksheet.csv")
print(d)
print(d["date"][9])

      date  strike prices   open   high    low    LTP
0   May-30            140   9.50  15.35   8.55  12.15
1   Jun-30            150   2.90   6.55   2.70   3.80
2   Jul-30            160   1.10   2.10   0.65   0.80
3   Jun-27            140  17.00  21.00  16.80  18.75
4   Jul-27            150  12.00  15.25  11.75  13.10
5   Aug-27            160   8.15  10.70   7.90   9.05
6   May-30            140   1.30   1.30   0.30   0.30
7   Jun-30            150   4.55   4.55   1.30   1.45
8   Jul-30            160  11.90  12.00   6.75   8.60
9   Jun-27            140   8.70   9.40   6.80   7.55
10  Jul-27            150  13.50  14.05  10.90  11.90
11  Aug-27            160  19.70  19.70  16.25  17.45
Jun-27

In [87]:
d.loc[9]

date             Jun-27
strike prices       140
open                8.7
high                9.4
low                 6.8
LTP                7.55
Name: 9, dtype: object

In [90]:

d.loc[ :,'date']

0     May-30
1     Jun-30
2     Jul-30
3     Jun-27
4     Jul-27
5     Aug-27
6     May-30
7     Jun-30
8     Jul-30
9     Jun-27
10    Jul-27
11    Aug-27
Name: date, dtype: object

In [91]:

d.loc[ :,'strike prices']

0     140
1     150
2     160
3     140
4     150
5     160
6     140
7     150
8     160
9     140
10    150
11    160
Name: strike prices, dtype: int64

In [97]:
d.iloc[:,3]

0     15.35
1      6.55
2      2.10
3     21.00
4     15.25
5     10.70
6      1.30
7      4.55
8     12.00
9      9.40
10    14.05
11    19.70
Name: high, dtype: float64

In [98]:
d.iloc[1,1]

150

In [116]:
print(d)
d.loc[[1,2,5,4],['open','high','low','LTP']]

      date  strike prices   open   high    low    LTP
0   May-30            140   9.50  15.35   8.55  12.15
1   Jun-30            150   2.90   6.55   2.70   3.80
2   Jul-30            160   1.10   2.10   0.65   0.80
3   Jun-27            140  17.00  21.00  16.80  18.75
4   Jul-27            150  12.00  15.25  11.75  13.10
5   Aug-27            160   8.15  10.70   7.90   9.05
6   May-30            140   1.30   1.30   0.30   0.30
7   Jun-30            150   4.55   4.55   1.30   1.45
8   Jul-30            160  11.90  12.00   6.75   8.60
9   Jun-27            140   8.70   9.40   6.80   7.55
10  Jul-27            150  13.50  14.05  10.90  11.90
11  Aug-27            160  19.70  19.70  16.25  17.45

    open   high    low    LTP
1   2.90   6.55   2.70   3.80
2   1.10   2.10   0.65   0.80
5   8.15  10.70   7.90   9.05
4  12.00  15.25  11.75  13.10

In [103]:
print(d)
d.iloc[[3,1],[1,3]]

      date  strike prices   open   high    low    LTP
0   May-30            140   9.50  15.35   8.55  12.15
1   Jun-30            150   2.90   6.55   2.70   3.80
2   Jul-30            160   1.10   2.10   0.65   0.80
3   Jun-27            140  17.00  21.00  16.80  18.75
4   Jul-27            150  12.00  15.25  11.75  13.10
5   Aug-27            160   8.15  10.70   7.90   9.05
6   May-30            140   1.30   1.30   0.30   0.30
7   Jun-30            150   4.55   4.55   1.30   1.45
8   Jul-30            160  11.90  12.00   6.75   8.60
9   Jun-27            140   8.70   9.40   6.80   7.55
10  Jul-27            150  13.50  14.05  10.90  11.90
11  Aug-27            160  19.70  19.70  16.25  17.45

   strike prices   high
3            140  21.00
1            150   6.55

In [122]:
print(d)
d.loc[:,['date','high']]

      date  strike prices   open   high    low    LTP
0   May-30            140   9.50  15.35   8.55  12.15
1   Jun-30            150   2.90   6.55   2.70   3.80
2   Jul-30            160   1.10   2.10   0.65   0.80
3   Jun-27            140  17.00  21.00  16.80  18.75
4   Jul-27            150  12.00  15.25  11.75  13.10
5   Aug-27            160   8.15  10.70   7.90   9.05
6   May-30            140   1.30   1.30   0.30   0.30
7   Jun-30            150   4.55   4.55   1.30   1.45
8   Jul-30            160  11.90  12.00   6.75   8.60
9   Jun-27            140   8.70   9.40   6.80   7.55
10  Jul-27            150  13.50  14.05  10.90  11.90
11  Aug-27            160  19.70  19.70  16.25  17.45

      date   high
0   May-30  15.35
1   Jun-30   6.55
2   Jul-30   2.10
3   Jun-27  21.00
4   Jul-27  15.25
5   Aug-27  10.70
6   May-30   1.30
7   Jun-30   4.55
8   Jul-30  12.00
9   Jun-27   9.40
10  Jul-27  14.05
11  Aug-27  19.70

In [119]:
print(d)
d.iloc[:,[1,3]]

      date  strike prices   open   high    low    LTP
0   May-30            140   9.50  15.35   8.55  12.15
1   Jun-30            150   2.90   6.55   2.70   3.80
2   Jul-30            160   1.10   2.10   0.65   0.80
3   Jun-27            140  17.00  21.00  16.80  18.75
4   Jul-27            150  12.00  15.25  11.75  13.10
5   Aug-27            160   8.15  10.70   7.90   9.05
6   May-30            140   1.30   1.30   0.30   0.30
7   Jun-30            150   4.55   4.55   1.30   1.45
8   Jul-30            160  11.90  12.00   6.75   8.60
9   Jun-27            140   8.70   9.40   6.80   7.55
10  Jul-27            150  13.50  14.05  10.90  11.90
11  Aug-27            160  19.70  19.70  16.25  17.45

    strike prices   high
0             140  15.35
1             150   6.55
2             160   2.10
3             140  21.00
4             150  15.25
5             160  10.70
6             140   1.30
7             150   4.55
8             160  12.00
9             140   9.40
10            150  14.05
11            160  19.70

In [123]:
print(d)
d.iloc[2:4,1:3]

      date  strike prices   open   high    low    LTP
0   May-30            140   9.50  15.35   8.55  12.15
1   Jun-30            150   2.90   6.55   2.70   3.80
2   Jul-30            160   1.10   2.10   0.65   0.80
3   Jun-27            140  17.00  21.00  16.80  18.75
4   Jul-27            150  12.00  15.25  11.75  13.10
5   Aug-27            160   8.15  10.70   7.90   9.05
6   May-30            140   1.30   1.30   0.30   0.30
7   Jun-30            150   4.55   4.55   1.30   1.45
8   Jul-30            160  11.90  12.00   6.75   8.60
9   Jun-27            140   8.70   9.40   6.80   7.55
10  Jul-27            150  13.50  14.05  10.90  11.90
11  Aug-27            160  19.70  19.70  16.25  17.45

   strike prices  open
2            160   1.1
3            140  17.0

In [129]:
print(d)
d.loc[5:8,'open':'LTP']

      date  strike prices   open   high    low    LTP
0   May-30            140   9.50  15.35   8.55  12.15
1   Jun-30            150   2.90   6.55   2.70   3.80
2   Jul-30            160   1.10   2.10   0.65   0.80
3   Jun-27            140  17.00  21.00  16.80  18.75
4   Jul-27            150  12.00  15.25  11.75  13.10
5   Aug-27            160   8.15  10.70   7.90   9.05
6   May-30            140   1.30   1.30   0.30   0.30
7   Jun-30            150   4.55   4.55   1.30   1.45
8   Jul-30            160  11.90  12.00   6.75   8.60
9   Jun-27            140   8.70   9.40   6.80   7.55
10  Jul-27            150  13.50  14.05  10.90  11.90
11  Aug-27            160  19.70  19.70  16.25  17.45

    open   high   low   LTP
5   8.15  10.70  7.90  9.05
6   1.30   1.30  0.30  0.30
7   4.55   4.55  1.30  1.45
8  11.90  12.00  6.75  8.60

In [130]:
d.loc[:,'open']

0      9.50
1      2.90
2      1.10
3     17.00
4     12.00
5      8.15
6      1.30
7      4.55
8     11.90
9      8.70
10    13.50
11    19.70
Name: open, dtype: float64

In [ ]:
d.loc[:,'open']

In [133]:
d.iloc[:,1]

0     140
1     150
2     160
3     140
4     150
5     160
6     140
7     150
8     160
9     140
10    150
11    160
Name: strike prices, dtype: int64

In [134]:
d['LTP']

0     12.15
1      3.80
2      0.80
3     18.75
4     13.10
5      9.05
6      0.30
7      1.45
8      8.60
9      7.55
10    11.90
11    17.45
Name: LTP, dtype: float64

In [137]:
d[['high','LTP']]

     high    LTP
0   15.35  12.15
1    6.55   3.80
2    2.10   0.80
3   21.00  18.75
4   15.25  13.10
5   10.70   9.05
6    1.30   0.30
7    4.55   1.45
8   12.00   8.60
9    9.40   7.55
10  14.05  11.90
11  19.70  17.45